# GetLocation Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyPointLocation..::..GetLocation Method
FamilyPointLocation Class See Also
---
Gets the location of the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public Transform GetLocation()
```

Visual Basic
---
```text
Public Function GetLocation As Transform
```

Visual C++
---
```text
public:
Transform^ GetLocation()
```

# ### Return Value
The location of the point.
# See Also
FamilyPointLocation Class
Autodesk.Revit.DB Namespace